DataProcessors/РезультатыПроверкиПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>РезультатыПроверкиПодписи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПравилаПроверкиПолномочийПоМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ПравилаПроверкиПолномочийПоМЧД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПравилоПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверкиПолномочийМЧД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/РезультатыПроверкиПодписи/Forms/ОшибкиПроверкиПолномочийПриПодписании/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Доверенности = Новый Соответствие();
	
	Для Каждого Ошибка Из Параметры.ОшибкиПроверкиПолномочий Цикл
		
		ПараметрыПоиска = Новый Структура("Документ, Ссылка", Ошибка.ЭлектронныйДокумент, Ошибка.Доверенность);
		НайденныеСтроки = ТаблицаОшибок.НайтиСтроки(ПараметрыПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаОшибок.Добавить();
		СтрокаТаблицы.Ссылка = Ошибка.Доверенность;
		СтрокаТаблицы.ТекстОшибки = Ошибка.ТекстОшибки;
		СтрокаТаблицы.Полномочия = МашиночитаемыеДоверенности.ТекстПолномочий(, СтрокаТаблицы.Ссылка);
		СтрокаТаблицы.Документ = Ошибка.ЭлектронныйДокумент;
		СвойстваМЧД = МашиночитаемыеДоверенности.НовыеСвойстваДоверенности();
		СвойстваСтрокой = "ДатаВыдачи, ДатаОкончания,
			|Отозвана, ДатаОтзыва, СтатусВРеестреФНС, Верна, ПолномочияОграничены";
		ДанныеМЧД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.Ссылка, СвойстваСтрокой);
		ЗаполнитьЗначенияСвойств(СвойстваМЧД, ДанныеМЧД);
		СвойстваМЧД.ПравилоПроверки =
			РегистрыСведений.ПравилаПроверкиПолномочийПоМЧД.ПравилоПроверки(СтрокаТаблицы.Ссылка);
		СтрокаТаблицы.ДоверенностьНеНастроена =
			НЕ МашиночитаемыеДоверенности.ВозможнаАвтопроверкаПолномочий(СвойстваМЧД);
		
		Если Доверенности[Ошибка.Доверенность] = Неопределено Тогда
			Доверенности.Вставить(Ошибка.Доверенность, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстПредупреждения = НСтр("ru = 'Сертификатом <a href = ""%1"">%2</a> можно подписать только по доверенности.
		|Найдены действующие доверенности (%3), но они не подходят по полномочиям.'");
	ТекстПредупреждения = СтроковыеФункции.ФорматированнаяСтрока(ТекстПредупреждения,
		ПолучитьНавигационнуюСсылку(Параметры.Сертификат), Параметры.Сертификат, Доверенности.Количество());
	Элементы.ТекстПредупреждения1.Заголовок = ТекстПредупреждения;
	
	ТекстПредупреждения = НСтр("ru = 'Что делать:'");
	Элементы.ТекстПредупреждения2.Заголовок = ТекстПредупреждения;
	
	ТекстРекомендации = НСтр("ru = 'настройте правила проверки полномочий;'");
	Элементы.ТекстРекомендации1.Заголовок = ТекстРекомендации;
	
	ТекстРекомендации = НСтр("ru = 'либо оформите подходящую доверенность;'");
	Элементы.ТекстРекомендации2.Заголовок = ТекстРекомендации;
	
	ТекстРекомендации = НСтр("ru = 'либо передайте документ на подпись руководителю.'");
	Элементы.ТекстРекомендации3.Заголовок = ТекстРекомендации;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибок

&НаКлиенте
Процедура ОшибкиПроверкиПолномочийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ТаблицаОшибокСсылка ИЛИ Поле = Элементы.ТаблицаОшибокПолномочия Тогда
		ПоказатьЗначение(, ТаблицаОшибок[ВыбраннаяСтрока].Ссылка);
	ИначеЕсли Поле = Элементы.ТаблицаОшибокДокумент Тогда
		ПоказатьЗначение(, ТаблицаОшибок[ВыбраннаяСтрока].Документ);
	ИначеЕсли Поле = Элементы.ТаблицаОшибокТекстОшибки Тогда
		ПоказатьПредупреждение(, ТаблицаОшибок[ВыбраннаяСтрока].ТекстОшибки,,
			Элемент.ПодчиненныеЭлементы.ТаблицаОшибокТекстОшибки.Заголовок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"ЦветФона", ЦветаСтиля.ЦветФонаНедействительнаяМЧД);
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОшибок.ДоверенностьНеНастроена");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОшибокТекстОшибки");
	
КонецПроцедуры

#КонецОбласти
